9/data/attachments/9c40dbf8420ac8d7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Randy_plan_Friend_88520_5</nif:username>
            <nif:friendToBeRequested>soap_friends_023a720d-da53-4df2-83d6-81a01cdc8840</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>